"""Сборник текстов для интерфейса взаимодействия с пользователем"""
greet_cont_replay = ('С возвращением {name}! Это первое сообщение после команды старт, профиль уже был в базе '
                     'данных. Чтобы посмотреть команды, введите /help')
greet_cont = """Приветствую в телеграм боте Элеоноры - тренера и нутрициолога.
Пишу о том, как быть круглый год в хорошей форме, здоровым и весёлым-)
Чтобы посмотреть команды, введите /help"""

main_menu = "📍 Главное меню"
go_to_telegram_channel = "Посетите мой публичный телеграм-канал. Там много интересного."
go_to_point_menu = 'В данном разделе хранятся все ваши данные. Для перехода выберите соответствующий пункт меню'

account_menu_1 = 'Ваш профиль.'
account_menu_2 = 'Для изменения нажмите на соответствующую кнопку'
account_qst_clear = 'У вас уже есть профиль, хотите его очистить?'
account_rec_datas = 'Подождите, данные записываются.'
clear_account_question = 'Хотите сбросить профиль?'
clear_account_true = 'Аккаунт очищен.'
clear_account_wait = 'Идет удаление аккаунта...'
clear_account_cancel = 'Очистка аккаунта отменена.'
update_profile_wait = 'Идет обновление данных...'
update_account_true = 'Обновление данных прошло успешно.'
update_account_false = 'При обновлении данных произошла ошибка.'
update_profile_enter_data = 'Введите новые данные.'
update_account_cancel = 'Изменение данных отменено.'


err_command = '🚫 Команда не распознана!'
err_user_access_rights = '⚠️ У вас нету доступа к боту! ⚠️ \nНажмите 👉 /start 👈 \nдля открытия доступа.'
err = '❌ Что-то пошло не по плану ❌\n😎 Если вы нам об этом напишите мы постараемся это по фиксить 😎'
err_reg_fatal = """☠ Произошла критическая ошибка при регистрации.☠ \n✉ Уведомите пожалуйста администратора.
Следующее сообщение будет отправлено администратору."""
err_reg_fatal_kb = '⚠️ Автоматическое уведомление администратора ⚠️'
