"""Сборник текстов для интерфейса взаимодействия с пользователем"""

greet_cont = """Приветствую в телеграм боте Элеоноры - тренера и нутрициолога.
Пишу о том, как быть круглый год в хорошей форме, здоровым и весёлым-)
Чтобы посмотреть команды, введите /help"""

menu = "📍 Главное меню"
go_to_telegram_channel = """Посетите мой публичный телеграм-канал. Там много интересного."""
go_to_point_menu = 'В данном разделе хранятся все ваши данные. Для перехода выберите соответствующий пункт меню'


account_menu_1 = 'Ваш профиль.'
account_menu_2 = 'Для изменения нажмите на соответствующую кнопку'
account_qst_clear = 'У вас уже есть профиль, хотите его очистить?'
account_rec_datas = 'Подождите, данные записываются.'
clear_account_question = 'Хотите сбросить профиль?'
clear_account_true = 'Аккаунт очищен.'
clear_account_wait = 'Идет удаление аккаунта...'
clear_account_cancel = 'Очистка аккаунта отменена.'
update_profile_wait = 'Идет обновление данных...'
update_account_true = 'Обновление данных прошло успешно.'
update_account_false = 'При обновлении данных произошла ошибка.'
update_profile_enter_data = 'Введите новые данные.'
update_account_cancel = 'Изменение данных отменено.'
update_gender = 'Выберите ваш пол.'
update_communication_channels = 'Выберите предпочтительный канал связи.'
update_phone = 'Поделитесь своим контактом или введите номер телефона вручную.'
update_email = 'Введите email.'


err = "🚫 К сожалению произошла ошибка, попробуйте позже"
err_command = 'Неверная команда. Потом надо че-нить написать для помощи, а пока мне в падлу 😎'
err_reg_fatal = """Произошла критическая ошибка при регистрации. Уведомите пожалуйста администратора.
Следующее сообщение будет отправлено администратору."""
